package com.bingya.web.system;

import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestMapping;

@Controller
@RequestMapping("/test")
public class Test {
	//---------------------------------------------------
	// 常量（全部大写，用下划线分割），变量 （先常后私）
	//---------------------------------------------------

	//---------------------------------------------------
	// public 公有方法
	//---------------------------------------------------

	//---------------------------------------------------
	// protected 方法
	//---------------------------------------------------

	//---------------------------------------------------
	// private 私有方法
	//---------------------------------------------------
}
