/***********************************************
 **** 版权声明处 **
 ****  为了方便阅读和维护，请严格遵守相关代码规范，谢谢   ****
 *******************************************/
package com.hjx.graphic.events
{
	/*******************************************
	 **** huangjixin,2013-4-3,上午10:10:37 作者：黄记新**
	 **** Graph滚动条事件  **
	 *******************************************/
	import flash.events.Event;
	
	public class GraphScrollerEvent extends Event
	{
		//--------------------------------------------------------
		// private 类私有静态变量和静态常量声明处。（全部大写，使用下划线进行分割）
		// 例如：private static const EXAMPLE:String = "example";
		//--------------------------------------------------------
		
		//--------------------------------------------------------
		// public 类公有静态变量和静态常量声明处。（全部大写，使用下划线进行分割）
		// 例如：public static const EXAMPLE:String = "example";
		//--------------------------------------------------------
		/**
		 * 可视化区域改变事件。 
		 */
		public static const VISIBLE_GRAPH_AREA_CHANGED : String = "visibleGraphAreaChanged";
		/**
		 * 缩放改变事件。 
		 */
		public static const ZOOM_CHANGE : String = "zoomChange";
		/**
		 * 缩放改变时事件常量。 
		 */
		public static const ZOOM_CHANGING : String = "zoomChanging";
		/**
		 *  
		 */
		public static const ZOOM_COMMIT : String = "zoomCommit";
		
		
		//--------------------------------------------------------
		// private 私有变量声明处，请以“_”开头定义变量
		// 例如：private var _example:String;
		//--------------------------------------------------------
		
		
		//--------------------------------------------------------
		// public 公有变量声明处
		//--------------------------------------------------------
		
		
		//--------------------------------------------------------
		// 构造函数，初始化相关工作可以放在里面
		//--------------------------------------------------------
		public function GraphScrollerEvent(type:String, bubbles:Boolean=false, cancelable:Boolean=false)
		{
			//TODO: implement function
			super(type, bubbles, cancelable);
		}//构造函数结束
		
		
		//--------------------------------------------------------
		// getter和setter函数
		//--------------------------------------------------------
		
		
		//--------------------------------------------------------
		// 相关事件响应函数和逻辑函数存放处
		//--------------------------------------------------------
		
		
		//--------------------------------------------------------
		// override 覆盖函数
		//--------------------------------------------------------
	}//类结束
}//包结束